In [1]:
%load_ext sql
!env | grep POST
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

POSTGRESQL_USER=reader
POSTGRESQL_PASSWORD=Miba2021

In [11]:
import psycopg2

with psycopg2.connect(
    dbname='jovyan'
) as conn:
    with conn.cursor() as cur:
        cur.execute('SELECT datname FROM pg_database')
        records = cur.fetchall()
        
print(records)

[('postgres',), ('jovyan',), ('template1',), ('template0',)]

In [12]:
%%sql postgresql:///jovyan
CREATE TABLE Departments (DEPARTMENT_ID INT PRIMARY KEY,
                          DEPARTMENT_NAME VARCHAR(50),
                          MANAGER_ID INT)

(psycopg2.errors.DuplicateTable) relation "departments" already exists

[SQL: CREATE TABLE Departments (DEPARTMENT_ID INT PRIMARY KEY,
                          DEPARTMENT_NAME VARCHAR(50),
                          MANAGER_ID INT)]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [13]:
%%sql postgresql:///jovyan
CREATE TABLE Employees (EMPLOYEE_ID INT PRIMARY KEY,
                        FIRST_NAME VARCHAR(20),
                        LAST_NAME VARCHAR(20),
                        HIRE_DATE DATE,
                        JOB_ID VARCHAR(20),
                        MANAGER_ID INT,
                        DEPARTMENT_ID INT)

Done.

[]

In [14]:
%%sql postgresql:///jovyan

INSERT INTO Employees (EMPLOYEE_ID, FIRST_NAME, LAST_NAME, HIRE_DATE, JOB_ID, MANAGER_ID, DEPARTMENT_ID)
VALUES
(100, 'Steven', 'King', '1987-06-17', 'AD_PRES', 0, 90),
(101, 'Neena', 'Kochhar', '1987-06-18', 'AD_VP', 100, 90),
(102, 'Lex', 'DeHaan', '1987-06-19', 'AD_VP', 100, 90),
(103, 'Alexander', 'Hunold', '1987-06-20', 'IT_PROG', 102, 60),
(107, 'Diana', 'Lorentz', '1987-06-24', 'IT_PROG', 103, 60),
(108, 'Nancy', 'Greenberg', '1987-06-25', 'FI_MGR', 101, 100),
(109, 'Daniel', 'Faviet', '1987-06-26', 'FI_ACCOUNT', 108, 100),
(114, 'Den', 'Raphaely', '1987-07-01', 'PU_MAN', 100, 30),
(118, 'Guy', 'Himuro', '1987-07-05', 'PU_CLERK', 114, 30),
(144, 'Peter', 'Vargas', '1987-07-31', 'ST_CLERK', 114, 50),
(145, 'John', 'Russell', '1987-08-01', 'SA_MAN', 100, 80),
(146, 'Karen', 'Partners', '1987-08-02', 'SA_MAN', 100, 80)

12 rows affected.

[]

In [15]:
%%sql postgresql:///jovyan
INSERT INTO Departments (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID)
VALUES
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205)

(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "departments_pkey"
DETAIL:  Key (department_id)=(10) already exists.

[SQL: INSERT INTO Departments (DEPARTMENT_ID, DEPARTMENT_NAME, MANAGER_ID)
VALUES
(10, 'Administration', 200),
(30, 'Purchasing', 114),
(40, 'HumanResources', 203),
(50, 'Shipping', 121),
(60, 'IT', 103),
(70, 'PublicRelations', 204),
(80, 'Sales', 145),
(90, 'Executive', 100),
(100, 'Finance', 108),
(110, 'Accounting', 205)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [16]:
%%sql postgresql:///jovyan
select * from Employees

12 rows affected.

[(100, 'Steven', 'King', datetime.date(1987, 6, 17), 'AD_PRES', 0, 90),
 (101, 'Neena', 'Kochhar', datetime.date(1987, 6, 18), 'AD_VP', 100, 90),
 (102, 'Lex', 'DeHaan', datetime.date(1987, 6, 19), 'AD_VP', 100, 90),
 (103, 'Alexander', 'Hunold', datetime.date(1987, 6, 20), 'IT_PROG', 102, 60),
 (107, 'Diana', 'Lorentz', datetime.date(1987, 6, 24), 'IT_PROG', 103, 60),
 (108, 'Nancy', 'Greenberg', datetime.date(1987, 6, 25), 'FI_MGR', 101, 100),
 (109, 'Daniel', 'Faviet', datetime.date(1987, 6, 26), 'FI_ACCOUNT', 108, 100),
 (114, 'Den', 'Raphaely', datetime.date(1987, 7, 1), 'PU_MAN', 100, 30),
 (118, 'Guy', 'Himuro', datetime.date(1987, 7, 5), 'PU_CLERK', 114, 30),
 (144, 'Peter', 'Vargas', datetime.date(1987, 7, 31), 'ST_CLERK', 114, 50),
 (145, 'John', 'Russell', datetime.date(1987, 8, 1), 'SA_MAN', 100, 80),
 (146, 'Karen', 'Partners', datetime.date(1987, 8, 2), 'SA_MAN', 100, 80)]

In [17]:
%%sql postgresql:///jovyan
select * from departments

10 rows affected.

[(10, 'Administration', 200),
 (30, 'Purchasing', 114),
 (40, 'HumanResources', 203),
 (50, 'Shipping', 121),
 (60, 'IT', 103),
 (70, 'PublicRelations', 204),
 (80, 'Sales', 145),
 (90, 'Executive', 100),
 (100, 'Finance', 108),
 (110, 'Accounting', 205)]

In [26]:
%%sql postgresql:///jovyan

SELECT d.department_name AS "Department Name", mgr.first_name  ||' '|| mgr.first_name AS "Manager Name",  COUNT(emp.employee_id) AS "Number of Employees"
FROM Departments d
JOIN Employees emp USING (department_id)
LEFT JOIN Employees mgr ON d.manager_id = mgr.employee_id
GROUP BY  "Department Name", "Manager Name"
ORDER BY  "Department Name"

6 rows affected.

[('Executive', 'Steven Steven', 3),
 ('Finance', 'Nancy Nancy', 2),
 ('IT', 'Alexander Alexander', 2),
 ('Purchasing', 'Den Den', 2),
 ('Sales', 'John John', 2),
 ('Shipping', None, 1)]